# 202001549 장희권

In [1]:
import pandas as pd

In [5]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"], 
        "year": [200, 2001, 2002, 2001, 2002, 2003], 
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [6]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"], 
             index=["one", "two", "three", "four", "five", "six"])

In [7]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [8]:
frame2["debt"] = val

In [9]:
frame2

       year   state  pop  debt
one     200    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [10]:
frame2["eastern"] = frame2.state == "Ohio"

In [11]:
frame2

       year   state  pop  debt  eastern
one     200    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [12]:
del frame2["eastern"]

In [13]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

# 202001549 장희권